import type { BaseTranslation } from '../i18n-types'

const ar = {
	siteTitle: 'الغول',
	copyRightNotice: '{year} © الغول',
	WELCOMING: [
		"أهلا بكم ومرحبا في مدونتي! أنا مطور متحمس لمشاركة معرفتي مع الآخرين. آمل أن تجد مشاركاتي مفيدة وملهمة.",
		"مرحباً بك! أنا مطور وهذه هي مدونتي؛ أكتب عن الأشياء التي أتعلمها، والأشياء التي أقوم ببنائها، والأشياء التي أفكر فيها. آمل أن تجد الأمر ممتعًا!",
	],
	MY_BLOG: 'مدونتي',
	BLOG_ENTRY: 'هناك الكثير من الموارد لكثير من المواد التعليمية، ومن دواعي امتيازنا أن نكون موجودين في هذا العصر، كُن ملهماً و استخدمه بحكمة.',
	HOME_PAGE: 'الرئيسية',
	ABOUT_US: 'عنا',
	TAGS_PAGE: 'البطاقات',
	AUTHORS_PAGE: 'الكُتاب',
	READ_MORE: 'المزيد',
	HOURS_AGO: 'منذ {hours} {{لاشئ|ساعة|ساعتين|ساعات|ساعة}}.',
	AUTHOR_POSTS_PAGE: 'مقالات {name}',
	ERROR_404: 'خطأ 404',
	ERROR_404_PAGE_NOT_FOUND: 'لم نتمكن من العثور على هذه الصفحة',
	AUTHOR_NOT_FOUND: 'لم نتمكن من العثور علي هذا الكاتب',
	AUTHORS_NOT_FOUND: 'لم نتمكن من العثور علي أي كاتب',
	TAG_NOT_FOUND: 'لم نتمكن من العثور علي هذه البطاقة',
	TAGS_NOT_FOUND: 'لم نتمكن من العثور علي أي بطاقة',
	POST_NOT_FOUND: 'لم نتمكن من العثور علي هذا المقال'
} satisfies BaseTranslation

export default ar
